// pages/tip/tip.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    info:'健身锻炼贵在持之以恒，健身锻炼不仅可以帮助我们增强免疫力，还有助于我们日常生活中.压力的释放，保持身心愉悦。由此看出，健身的好处有很多。但要更好的做好健身锻炼，就要了解一些基本的健身常识',
    arr:[
      {
        step:'1、先准备一块瑜伽垫',
        detail:'用我们该小程序前可以先准备一块瑜伽垫铺在地板上，有很多动作是需要趴在地板上的'
      },
      {
        step:'2、健身前要做好热身，避免健身受伤',
        detail:'很多人健身前没有意识到做热身动作，对身体和运动都有很大的好处，健身前要做好热身动作，能够有效地提高身体的血液循环和提高燃脂心率，让你更快地进入到健身的状态，还可以避免健身过程中受伤。'
      },
      {
        step:'3、健身前要补充营养',
        detail:`健身前补充一定的营养，比如一-根香蕉，或者是一个苹果等等，都可以给身体提供到足够的热量，不会因为在运动过程中消耗过多的热量和体能，而出现低血糖、晕厥现象。
        但是，健身前也不应该大鱼大肉，吃到吃撑再去健身的话，不仅会影响到健身的效果，还会给肠胃造成很大的压力，这点是对于健身的人来说是需要注意的。`
      },
      {
        step:'4、健身次数不是越多越好',
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})